# Задание 1. По двум заданным числам проверить является ли одно квадратом второго
#print('Введите первое число')
#a = int(input())
#print('Введите второе число')
#b = int(input())
# if a*a == b:
#    print(f"{b} является квадратом {a}")
# if b*b == a:
#    print(f"{a} является квадратом {b}")
# else:
#    print ("Числа не являются квадратами друг друга")

# Задание 2. Найти максимальное из пяти чисел
#my_list = (1, 2, 3, 4, 5)
# print(max(my_list))

# Задание 3. Вывести на экран числа от -N до N
#print('Введите число')
#n = int(input())
#a = range(-n,n)
# for i in a:
#    print(i)

# Задание 4. Показать первую цифру дробной части числа
#a = 2000.123
#a_string = str(a)
# print(a_string[a_string.find(".")+1])

# Задание 5. Дано число. Проверить кратно ли оно 5 и 10 или 15 но не 30
#a = 30
# if (a%5 == 0 and a%10 == 0) or (a%15 == 0 and not a % 30 == 0):
# print ("Кратно")
